# Pandas Basic

In [1]:
import pandas as pd

## Creating a series with custom indexes

In [18]:



car_names = ["Toyota", "Honda", "Ford", "Chevrolet", "Nissan", "Volkswagen", "BMW", "Mercedes-Benz", "Audi", "Lexus", "Subaru", "Hyundai", "Kia", "Mazda", "Jeep", "Tesla", "Porsche", "Ferrari", "Lamborghini","Jeep"]
colors = ["Red", "Orange", "Yellow", "Green", "Blue", "Purple", "Pink", "Brown", "Gray", "Black", "White", "Cyan", "Magenta", "Lime", "Teal", "Maroon", "Navy", "Olive", "Indigo", "Turquoise"]

car_series = pd.Series(car_names, index=colors)
print(car_series)
print(car_series["Yellow"])

Red                 Toyota
Orange               Honda
Yellow                Ford
Green            Chevrolet
Blue                Nissan
Purple          Volkswagen
Pink                   BMW
Brown        Mercedes-Benz
Gray                  Audi
Black                Lexus
White               Subaru
Cyan               Hyundai
Magenta                Kia
Lime                 Mazda
Teal                  Jeep
Maroon               Tesla
Navy               Porsche
Olive              Ferrari
Indigo         Lamborghini
Turquoise             Jeep
dtype: object
Ford

In [3]:
# Creating a DataFrame from a dictionary of data
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35],
        'City': ['New York', 'San Francisco', 'Los Angeles']}

df = pd.DataFrame(data)

# Displaying the DataFrame
print(df)

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles

In [2]:
car_sales = pd.read_csv('car-sales.csv')

In [3]:
print(car_sales)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [19]:
exported_car_sales = car_sales.to_csv("exported-car-sales.csv",index=False)

In [20]:
pd.read_csv('exported-car-sales.csv')

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00